<?php

$starWars = [
    "Новая надежда" => 1977,
    "Империя наносит ответный удар" => 1980,
    "Возвращение джедая" => 1983,
    "Скрытая угроза" => 1999,
    "Атака клонов" => 2002,
    "Месть ситхов" => 2005,
    "Пробуждение силы" => 2015,
    "Изгой-один: Звёздные войны. Истории" => 2016,
    "Последние джедаи" => 2017,
    "Хан Соло. Звёздные войны. Истории" => 2018,
    "Скайуокер. Восход" => 2019
];


$seatsInCinema = [
    'aisle1' => [1, 2, 3, 4, 5, 6, 7, 8],
    'aisle2' => [1, 2, 3, 4, 5, 6, 7, 8],
    'aisle3' => [1, 2, 3, 4, 5, 6, 7, 8],
    'aisle4' => [1, 2, 3, 4, 5, 6, 7, 8],
    'aisle5' => [1, 2, 3, 4, 5, 6, 7, 8],
    'aisle6' => [1, 2, 3, 4, 5, 6, 7, 8]
];


$scores = [
    'song' => [
        'Vasya' => [1, 2, 3, 4],
        'Petya' => [4, 2, 3, 4]
    ],
    'programming' => [
        'Vasya' => [12, 10, 5, 4],
        'Petya' => [4, 7, 9, 10]
    ]
];

