<?php

$starWars = [
    "Новая надежда" => 1977,
    "Империя наносит ответный удар" => 1980,
    "Возвращение джедая" => 1983,
    "Скрытая угроза" => 1999,
    "Атака клонов" => 2002,
    "Месть ситхов" => 2005,
    "Пробуждение силы" => 2015,
    "Изгой-один: Звёздные войны. Истории" => 2016,
    "Последние джедаи" => 2017,
    "Хан Соло. Звёздные войны. Истории" => 2018,
    "Скайуокер. Восход" => 2019
];

ksort($starWars);
foreach ($starWars as $key => $value) {
    echo "$key => $value \n";
}

//***********************************************



$scores = [
    'song' => [
        'Vasia' => [1, 2, 3, 4],
        'Petia' => [4, 2, 3, 4]
    ],
    'programming' => [
        'Vasia' => [12, 10, 5, 4],
        'Petia' => [4, 7, 9, 10]
    ]
];



foreach ($scores as &$sub) {
    foreach ($sub as &$sub1) {
        rsort($sub1);
    }
}

print_r($scores);
